## Filtering Pandas DataFrames

In [61]:
import pandas as pd
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35, 60000], ['Marry', 29, 58000]]
df = pd.DataFrame(data=data, columns=['Name', 'Age', 'Salary'])

In [62]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

### Conditional Selecting

In [63]:
df['Salary'] > 50000  # series of booleans

0    False
1    False
2     True
3     True
Name: Salary, dtype: bool

In [64]:
df[df['Salary'] > 50000]  #rows where salary is greater than 50000

    Name  Age  Salary
2  Helen   35   60000
3  Marry   29   58000

Equivalent to:

In [65]:
mask = df['Salary'] > 50000
df[mask]

    Name  Age  Salary
2  Helen   35   60000
3  Marry   29   58000

In [66]:
df[df.loc[:, 'Salary'] < 50000]

  Name  Age  Salary
0  Dan   30   40000

In [67]:
df[df.loc[:, 'Salary'] < 50000][['Name', 'Age']]

  Name  Age
0  Dan   30

In [68]:
df[df.loc[:, 'Age'] == 30]

  Name  Age  Salary
0  Dan   30   40000

In [69]:
df[~ (df.loc[:, 'Salary']< 50000)]

    Name  Age  Salary
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [70]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [71]:
df['Salary'].max()

60000

In [72]:
df.Age.min()

29

In [73]:
r = df['Salary'].idxmax() # the index of the row where the salary has the maximum value
r

2

In [74]:
df.iloc[r]

Name      Helen
Age          35
Salary    60000
Name: 2, dtype: object

In [75]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [76]:
df.set_index('Salary', inplace=True)  # changing the index in-place

In [77]:
df

         Name  Age
Salary
40000     Dan   30
50000    John   40
60000   Helen   35
58000   Marry   29

In [78]:
df.loc[50000]  #loc[] uses the index

Name    John
Age       40
Name: 50000, dtype: object

In [79]:
df.iloc[0]  #iloc[] uses ALWAYS numbers starting from zero

Name    Dan
Age      30
Name: 40000, dtype: object

In [80]:
df.set_index('Name', inplace=True)

In [81]:
df

       Age
Name
Dan     30
John    40
Helen   35
Marry   29

In [82]:
df.loc['John']

Age    40
Name: John, dtype: int64

In [83]:
df.iloc[1]

Age    40
Name: John, dtype: int64

In [84]:
df

       Age
Name
Dan     30
John    40
Helen   35
Marry   29

### Selecting on multiple conditions

Creating the original DataFrame again:

In [85]:
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35, 60000], ['Marry', 29, 58000]]
df = pd.DataFrame(data=data, columns=['Name', 'Age', 'Salary'])
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [86]:
df[(df['Salary']> 50000) | (df['Age'] < 30)]

    Name  Age  Salary
2  Helen   35   60000
3  Marry   29   58000

In [87]:
df[(df['Salary'] < 45000) & (df['Age'] <= 30)]

  Name  Age  Salary
0  Dan   30   40000

### df.between()

In [88]:
df[df['Salary'].between(45000, 59000)]

    Name  Age  Salary
1   John   40   50000
3  Marry   29   58000